app/Http/Controllers/Auth/RegisterController.php

    public function register(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:250',
            'email' => 'required|email|max:250|unique:users',
            'password' => 'required|min:8|confirmed'
        ]);

        User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password)
        ]);
---
insert into "users" ("name", "email", "password") values ('tester', 'tester@example.com', '$2y$10$yiueACoLDlP6PwT7NxdyeOl4ycKDJbKfE3Ivce8JmUjjtHHHWFapa') returning "id"