app/Http/Controllers/DashBoardController.php

select * from "posts"
---
    public function list()
    {

        $post = Post::all();