app/Http/Controllers/DashBoardController.php

select * from "posts" where "posts"."id" = '1' limit 1
---
     public function show(string $id): View
     {
        // Get the post.
        $post = Post::findOrFail($id);

select "id", "name" from "users" where "users"."id" in (1)
---
            return response()->json(['post' => $post, 'file' => 'error']);
        }

        $post->load('user:id,name,img');

select * from "posts" where "posts"."id" = '2' limit 1
---
    public function update(Request $request, $id)
    {
        // Find the post.
        $post = Post::find($id);

delete from "posts" where "id" = 2
---
    public function delete(Request $request, $id)
    {
        // Find the post.
        $post = Post::find($id);

        // Check if the current user is authorized to delete this post.
        $this->authorize('delete',$post);

        // Delete the post and return it as JSON.
        $post->delete();