app/Http/Controllers/MessageController.php

select distinct "users"."id", "users"."name" from "users" inner join "messages" on "users"."id" = "messages"."sender" and "messages"."receiver" = 7 or ("users"."id" = "messages"."receiver" and "messages"."sender" = 7) where "users"."id" != 7
---
    public function list_chats()
    {
        // Check if the user is logged in.
        if (!Auth::check()) {
            // Not logged in, redirect to login.
            return redirect('/login');

        } else {
            // The user is logged in.
            $currentUserId = Auth::user()->id;

            $users = Auth::user()->join('messages', function ($join) use ($currentUserId) {
                $join->on('users.id', '=', 'messages.sender')
                    ->where('messages.receiver', '=', $currentUserId)
                    ->orWhere(function ($query) use ($currentUserId) {
                        $query->on('users.id', '=', 'messages.receiver')
                            ->where('messages.sender', '=', $currentUserId);
                    });
            })
            ->distinct()
            ->where('users.id', '!=', $currentUserId)
            ->select('users.id', 'users.name')
            ->get();