app/Http/Controllers/ProfileController.php

    public function show(string $id)
    {
        $user = User::findOrFail($id);
        // Get posts for user ordered by id.
        $post = Post::where('user_id','=',$id)->orderBy('id')->get();
---
select * from "users" where "users"."id" = '7' limit 1
select * from "posts" where "posts"."user_id" = 7 and "posts"."user_id" is not null order by "id" asc