app/Http/Controllers/SearchController.php

select * from "users" where "name"::text like '%John%'
---
    public function search(Request $request) {
        $results = User::where('users.name', 'like', '%' . $request . '%')->get();